Documents/ОтправкаAWB.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ОтправкаAWB</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Затраты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>AWB</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Перевозчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗатрат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрибытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Инвойсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инвойс</Name>
							<Type>
								<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Затрата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТоварнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыПодбораНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаспределениеЗатрат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Затрата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОтправкаAWB/Ext/ManagerModule.bsl
// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт

	Возврат Новый Структура("Отправка,ПоИнвойсам", 
							НСтр("ru='Отправка';en='Shipment'"),
							НСтр("ru='По инвойсам';en='Invoises'")
							);		

КонецФункции 

Процедура ПечатьДокумента(ДокСсылка, ВариантПечатнойФормы, ТабДокумент, Параметры = 0) Экспорт
	
	Если НЕ (РольДоступна("Администратор") ИЛИ 
			РольДоступна("Логистика") ИЛИ 
			РольДоступна("Бухгалтерия") ИЛИ 
			РольДоступна("Менеджер") ИЛИ 
			РольДоступна("МетреонПолный") ИЛИ 
			РольДоступна("МетреонЛогистика") ИЛИ
			РольДоступна("ПросмотрДокументаОтправка") ИЛИ 
			РольДоступна("ПриходованиеВводомНаОсновании")) Тогда 
		Сообщить(НСтр("ru = 'Недостаточно прав!'; en = 'Not enough rights!'"));
		Возврат;
	КонецЕсли;
	
	СкрытьЦены = (РольДоступна("Менеджер") ИЛИ РольДоступна("ПросмотрДокументаОтправка"))
				И НЕ РольДоступна("ВидимостьНаценки")
				И НЕ РольДоступна("Администратор");

	ТабДокумент.Очистить();
	Макет = Документы.ОтправкаAWB.ПолучитьМакет(ВариантПечатнойФормы);
	
	ЗапросШ = Новый Запрос;
	ЗапросШ.УстановитьПараметр("Ссылка", ДокСсылка);
	ЗапросШ.УстановитьПараметр("ПредставлениеДокумента",  ОбщегоНазначения.ПредставлениеДокументаДляПечати(ДокСсылка, ПолучитьСтруктуруПечатныхФорм()[ВариантПечатнойФормы]));
	ЗапросШ.Текст = "ВЫБРАТЬ
	                |	Отправка.Номер КАК Номер,
	                |	Отправка.Дата КАК Дата,
	                |	Отправка.AWB КАК AWB,
	                |	Отправка.Перевозчик КАК Перевозчик,
	                |	Отправка.СкладОтправитель КАК СкладОтправитель,
	                |	Отправка.СкладПолучатель КАК СкладПолучатель,
	                |	ВЫРАЗИТЬ(Отправка.Примечание КАК СТРОКА(1000)) КАК Примечание,
	                |	&ПредставлениеДокумента КАК ПредставлениеДокумента,
	                |	Отправка.Количество КАК Количество
	                |ИЗ
	                |	Документ.ОтправкаAWB КАК Отправка
	                |ГДЕ
	                |	Отправка.Ссылка = &Ссылка";
	Шапка = ЗапросШ.Выполнить().Выбрать();
	Шапка.Следующий();
	
	ТекстЗапросаТовары = "ВЫБРАТЬ
	                     |	Свод.Инвойс КАК Инвойс,
	                     |	Свод.Поставка КАК Поставка,
	                     |	Свод.Валюта КАК Валюта,
	                     |	Свод.НомерИнвойса КАК НомерИнвойса,
	                     |	Свод.Поставщик КАК Поставщик,
	                     |	Свод.Псевдоним КАК Псевдоним,
	                     |	Свод.ДатаЗакупки КАК ДатаЗакупки,
	                     |	Свод.Номенклатура КАК Номенклатура,
	                     |	Свод.Количество КАК Количество,
	                     |	ВЫБОР
	                     |		КОГДА &СкрытьЦены
	                     |			ТОГДА 0
	                     |		ИНАЧЕ Свод.Сумма
	                     |	КОНЕЦ КАК Сумма
	                     |ПОМЕСТИТЬ ТЗ
	                     |ИЗ
	                     |	(ВЫБРАТЬ
	                     |		ОтправкаИнвойсы.Инвойс КАК Инвойс,
	                     |		ОтправкаИнвойсы.Поставка КАК Поставка,
	                     |		ОтправкаИнвойсы.Инвойс.Валюта.Символ КАК Валюта,
	                     |		ОтправкаИнвойсы.Инвойс.ВКД_НомерИнвойсаПоставщика КАК НомерИнвойса,
	                     |		ОтправкаИнвойсы.Инвойс.Контрагент КАК Поставщик,
	                     |		ОтправкаИнвойсы.Инвойс.Контрагент.Псевдоним КАК Псевдоним,
	                     |		ОтправкаИнвойсы.Инвойс.ВКД_ДатаИнвойсаПоставщика КАК ДатаЗакупки,
	                     |		ПоставкиИнвойса.Номенклатура КАК Номенклатура,
	                     |		ПоставкиИнвойса.Количество КАК Количество,
	                     |		ПоставкиИнвойса.Сумма КАК Сумма,
	                     |		ПоставкиИнвойса.НомерСтроки КАК ИндСтроки
	                     |	ИЗ
	                     |		Документ.ОтправкаAWB.Инвойсы КАК ОтправкаИнвойсы
	                     |			ЛЕВОЕ СОЕДИНЕНИЕ Документ._Инвойс.Поставки КАК ПоставкиИнвойса
	                     |			ПО ОтправкаИнвойсы.Инвойс = ПоставкиИнвойса.Ссылка
	                     |				И ОтправкаИнвойсы.Поставка = ПоставкиИнвойса.Поставка
	                     |	ГДЕ
	                     |		ОтправкаИнвойсы.Ссылка = &Ссылка
	                     |		И ПоставкиИнвойса.Ссылка.КоличествоПоставок > 0
	                     |	
	                     |	ОБЪЕДИНИТЬ
	                     |	
	                     |	ВЫБРАТЬ
	                     |		ОтправкаИнвойсы.Инвойс,
	                     |		ОтправкаИнвойсы.Поставка,
	                     |		ОтправкаИнвойсы.Инвойс.Валюта.Символ,
	                     |		ОтправкаИнвойсы.Инвойс.ВКД_НомерИнвойсаПоставщика,
	                     |		ОтправкаИнвойсы.Инвойс.Контрагент,
	                     |		ОтправкаИнвойсы.Инвойс.Контрагент.Псевдоним,
	                     |		ОтправкаИнвойсы.Инвойс.ВКД_ДатаИнвойсаПоставщика,
	                     |		ИнвойсОднойПоставкой.Номенклатура,
	                     |		ИнвойсОднойПоставкой.Количество,
	                     |		ИнвойсОднойПоставкой.СуммаЗакупки,
	                     |		ИнвойсОднойПоставкой.НомерСтроки
	                     |	ИЗ
	                     |		Документ.ОтправкаAWB.Инвойсы КАК ОтправкаИнвойсы
	                     |			ЛЕВОЕ СОЕДИНЕНИЕ Документ._Инвойс.ВКД_Товары КАК ИнвойсОднойПоставкой
	                     |			ПО ОтправкаИнвойсы.Инвойс = ИнвойсОднойПоставкой.Ссылка
	                     |	ГДЕ
	                     |		ОтправкаИнвойсы.Ссылка = &Ссылка
	                     |		И ИнвойсОднойПоставкой.Ссылка.КоличествоПоставок = 0) КАК Свод";
	ТекстЗапросаТовары = ТекстЗапросаТовары + "; ";
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.УстановитьПараметр("СкрытьЦены", СкрытьЦены);
	
	Если ВариантПечатнойФормы = "Отправка" Тогда

		Запрос.Текст = ТекстЗапросаТовары + "ВЫБРАТЬ
		               |	ТЗ.Номенклатура КАК Номенклатура,  
					   |	ТЗ.Номенклатура.Вес КАК Вес,
		               |	СУММА(ТЗ.Количество) КАК Количество,
		               |	СУММА(ТЗ.Сумма) КАК Сумма,
		               |	среднее(ТЗ.Сумма / ТЗ.Количество) КАК Цена,
 						|	СУММА(ТЗ.Количество) * ТЗ.Номенклатура.Вес / 1000 КАК ИтВес
 						|ИЗ ТЗ      
					   |
					   |  сгруппировать по ТЗ.Номенклатура,
					   |  ТЗ.Номенклатура.Вес
					   |
		               |УПОРЯДОЧИТЬ ПО
		               |	ТЗ.Номенклатура.Наименование
		               |ИТОГИ
		               |	СУММА(Количество),
		               |	СУММА(Сумма), 
					   |	Среднее(Цена),
					   |	Среднее(Вес), Сумма(ИтВес)
		               |ПО Общие,
		               |	Номенклатура ИЕРАРХИЯ"; 
		
		глВывестиСекцию(ТабДокумент, Макет, "Шапка", Шапка);

		Итоги = Запрос.Выполнить().Выбрать();
		Итоги.Следующий();

		ОбластьДно = Макет.ПолучитьОбласть("Дно");
		ОбластьДно.Параметры.Заполнить(Шапка);  
		ОбластьДно.Параметры.Сумма 		= Итоги.Сумма;
		ОбластьДно.Параметры.Количество = Итоги.Количество;
		ОбластьДно.Параметры.ИтВес 		= Итоги.ИтВес;

		Итоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, "Номенклатура");
		ТабДокумент.НачатьАвтогруппировкуСтрок();
		ВыбратьЭлементыВИерархии(Итоги, Макет, ТабДокумент); 
		ТабДокумент.ЗакончитьАвтогруппировкуСтрок();

		ТабДокумент.Вывести(ОбластьДно);
		
	ИначеЕсли ВариантПечатнойФормы = "ПоИнвойсам" Тогда
		
		ЗапрТовары = Новый Запрос;  
		ЗапрТовары.УстановитьПараметр("Ссылка", ДокСсылка);
		ЗапрТовары.Текст = "ВЫБРАТЬ
		                   |	ИнвойсВКДТовары.Номенклатура КАК Номенклатура,
		                   |	ИнвойсВКДТовары.Количество КАК Количество,
		                   |	ИнвойсВКДТовары.Ссылка КАК Инвойс
		                   |ИЗ
		                   |	Документ._Инвойс.ВКД_Товары КАК ИнвойсВКДТовары
		                   |ГДЕ
		                   |	ИнвойсВКДТовары.Ссылка В
		                   |			(ВЫБРАТЬ
		                   |				ОтправкаAWBИнвойсы.Инвойс КАК Инвойс
		                   |			ИЗ
		                   |				Документ.ОтправкаAWB.Инвойсы КАК ОтправкаAWBИнвойсы
		                   |			ГДЕ
		                   |				ОтправкаAWBИнвойсы.Ссылка = &Ссылка)
		                   |
		                   |УПОРЯДОЧИТЬ ПО
		                   |	ИнвойсВКДТовары.Номенклатура.Наименование
		                   |ИТОГИ
		                   |	СУММА(Количество)
		                   |ПО
		                   |	Инвойс,
		                   |	Номенклатура"; 
		
		глВывестиСекцию(ТабДокумент, Макет, "Шапка", Шапка);
		ВыборкаИнв = ЗапрТовары.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		ИтКоличество = ВыборкаИнв.Количество();
		Пока ВыборкаИнв.Следующий() Цикл
			глВывестиСекцию(ТабДокумент, Макет, "Инвойс", ВыборкаИнв);
			ВыборкаСтрока = ВыборкаИнв.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаСтрока.Следующий() Цикл
				глВывестиСекцию(ТабДокумент, Макет, "Строка", ВыборкаСтрока);
			КонецЦикла;
		КонецЦикла;
		
		глВывестиСекцию(ТабДокумент, Макет, "Дно", Шапка);
		
	//ИначеЕсли ВариантПечатнойФормы = "Прибытие" Тогда	

	//	Запрос.Текст = ТекстЗапросаТовары + "ВЫБРАТЬ
	//					|	ВЫБОР
	//					|		КОГДА СостоянияИнвойсов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыИнвойса.Прибыл)
	//					|			ТОГДА ИСТИНА
	//					|		ИНАЧЕ ЛОЖЬ
	//					|	КОНЕЦ КАК Прибыл,
	//					|	ТЗ.Номенклатура КАК Номенклатура,
	//					|	СУММА(ТЗ.Количество) КАК Количество,
	//					|	СУММА(ТЗ.Сумма) КАК Сумма,
	//					|	СРЕДНЕЕ(ТЗ.Сумма / ТЗ.Количество) КАК Цена
	//					|ИЗ
	//					|	ТЗ КАК ТЗ
	//					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияИнвойсов КАК СостоянияИнвойсов
	//					|		ПО ТЗ.Инвойс = СостоянияИнвойсов.Инвойс
	//					|
	//					|СГРУППИРОВАТЬ ПО
	//					|	ВЫБОР
	//					|		КОГДА СостоянияИнвойсов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыИнвойса.Прибыл)
	//					|			ТОГДА ИСТИНА
	//					|		ИНАЧЕ ЛОЖЬ
	//					|	КОНЕЦ,
	//					|	ТЗ.Номенклатура
	//					|УПОРЯДОЧИТЬ ПО
	//					|	ТЗ.Номенклатура.Наименование
	//					|ИТОГИ
	//					|	СУММА(Количество),
	//					|	СУММА(Сумма),
	//					|	СРЕДНЕЕ(Цена)
	//					|ПО
	//					|	ОБЩИЕ,
	//					|	Прибыл,
	//					|	Номенклатура ИЕРАРХИЯ";  
	//	
	//	глВывестиСекцию(ТабДокумент, Макет, "Шапка", Шапка);
	//	
	//	ОбластьСтатус = Макет.ПолучитьОбласть("Статус");

	//	ВыборкаИт = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//	ВыборкаИт.Следующий();   
	//	ОбластьДно = Макет.ПолучитьОбласть("Дно");
	//	ОбластьДно.Параметры.Заполнить(ВыборкаИт);
	//	
	//	ВыборкаС = ВыборкаИт.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//		//ТабДокумент.НачатьАвтогруппировкуСтрок();
	//	Пока ВыборкаС.Следующий() Цикл  

	//		ОбластьСтатус.Параметры.Заполнить(ВыборкаС);
	//		ОбластьСтатус.Параметры.Статус = ?(ВыборкаС.Прибыл, "Прибыл", "НЕ прибыл");
	//		ТабДокумент.Вывести(ОбластьСтатус);   
	//		
	//		т = ВыборкаС.Выбрать();
	//		ТабДокумент.НачатьАвтогруппировкуСтрок();
	//		ВыбратьЭлементыВИерархии(т, Макет, ТабДокумент); 
	//		ТабДокумент.ЗакончитьАвтогруппировкуСтрок();   

	//	КонецЦикла;	
	//	//	ТабДокумент.ЗакончитьАвтогруппировкуСтрок();
	//	
	//	ТабДокумент.Вывести(ОбластьДно);
	//	
	//ИначеЕсли ВариантПечатнойФормы = "ПакингЛист" Тогда	

	//	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	//	ОбластьМакета.Параметры.Заполнить(Шапка); 
	//	ТабДокумент.Вывести(ОбластьМакета);
	//	
	//	Запрос.Текст = ТекстЗапросаТовары +
	//				"ВЫБРАТЬ
	//				|	Свод.Инвойс КАК Инвойс,
	//				|	Свод.Инвойс.Валюта.Символ КАК Валюта,
	//				|	Свод.НомерИнвойса,
	//				|	Свод.Поставщик,
	//				|	Свод.Псевдоним,
	//				|	Свод.Номенклатура КАК Товар,
	//				|	Свод.Количество КАК Количество,
	//				|	Свод.Сумма КАК Сумма,
	//				|	Свод.Сумма / Свод.Количество КАК Цена
	//				|ИЗ ТЗ КАК Свод
	//				|ИТОГИ
	//				|	СУММА(Количество),
	//				|	СУММА(Сумма)
	//				|ПО
	//				|	ОБЩИЕ,
	//				|	Инвойс,
	//				|	Товар
	//				|АВТОУПОРЯДОЧИВАНИЕ";
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	Выгрузка = РезультатЗапроса.Выгрузить();
	//	ВыборкаИт = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//	ВыборкаИт.Следующий();   
	//	ОбластьДно = Макет.ПолучитьОбласть("Дно");
	//	ОбластьДно.Параметры.Заполнить(ВыборкаИт);
	//				   
	//	ОбластьИнвойс 	= Макет.ПолучитьОбласть("Инвойс");
	//	ОбластьТовар 	= Макет.ПолучитьОбласть("Товар");
	//	//ОбластьИтог 	= Макет.ПолучитьОбласть("Итог");
	//	
	//	ВыборкаИ = ВыборкаИт.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//	Пока ВыборкаИ.Следующий() Цикл    
	//		ОбластьИнвойс.Параметры.Заполнить(ВыборкаИ);
	//		ВыборкаТ = ВыборкаИ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//		Пока ВыборкаТ.Следующий() Цикл 
	//			//ОбластьТовар.Параметры.Заполнить(ВыборкаТ);
	//			//ТабДокумент.Вывести(ОбластьТовар);
	//			выб = ВыборкаТ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//			Пока Выб.Следующий() Цикл   
	//				ОбластьИнвойс.Параметры.Инвойс			= Выб.Инвойс;
	//				ОбластьИнвойс.Параметры.НомерИнвойса    = Выб.НомерИнвойса;
	//				ОбластьИнвойс.Параметры.Поставщик       = Выб.Поставщик;
	//				ОбластьИнвойс.Параметры.Псевдоним       = Выб.Псевдоним;
	//				ОбластьИнвойс.Параметры.Валюта       	= Выб.Валюта;
	//			КонецЦикла;
	//		КонецЦикла;
	//		ТабДокумент.Вывести(ОбластьИнвойс);   
	//		
	//		ВыборкаТ = ВыборкаИ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//		Пока ВыборкаТ.Следующий() Цикл 
	//			ОбластьТовар.Параметры.Заполнить(ВыборкаТ);
	//			ОбластьТовар.Параметры.Цена       			= ОбластьТовар.Параметры.Сумма / ОбластьТовар.Параметры.Количество;
	//			ТабДокумент.Вывести(ОбластьТовар);
	//		КонецЦикла;

	//	КонецЦикла;	

	//	//ТабДокумент.Вывести(ОбластьИтог);

	//	ТабДокумент.Вывести(ОбластьДно);
	//	
	//ИначеЕсли ВариантПечатнойФормы = "Отгрузки" Тогда	
	//	
	//	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	//	ОбластьМакета.Параметры.Заполнить(Шапка);
	//	ТабДокумент.Вывести(ОбластьМакета);

	//	Запрос.Текст = ТекстЗапросаТовары + 
	//					"ВЫБРАТЬ
	//					|	ТЗ.Инвойс,
	//					|	ТЗ.Поставщик,
	//					|	ТЗ.НомерИнвойса КАК НомерИнвойса,
	//					|	ТЗ.ДатаЗакупки,
	//					|	СУММА(ТЗ.Количество) КАК Количество,
	//					|	СУММА(ТЗ.Сумма) КАК Сумма,
	//					|	ТЗ.Валюта КАК Символ
	//					|ИЗ
	//					|	ТЗ КАК ТЗ
	//					|
	//					|СГРУППИРОВАТЬ ПО
	//					|	ТЗ.Инвойс,
	//					|	ТЗ.Поставщик,
	//					|	ТЗ.НомерИнвойса,
	//					|	ТЗ.ДатаЗакупки,
	//					|	ТЗ.Валюта
	//					|
	//					|УПОРЯДОЧИТЬ ПО
	//					|	НомерИнвойса
	//					|;
	//					|
	//					|////////////////////////////////////////////////////////////////////////////////
	//					|ВЫБРАТЬ
	//					|	СУММА(ТЗ.Количество) КАК Количество,
	//					|	СУММА(ТЗ.Сумма) КАК Сумма,
	//					|	ТЗ.Валюта КАК Валюта
	//					|ИЗ
	//					|	ТЗ КАК ТЗ
	//					|
	//					|СГРУППИРОВАТЬ ПО
	//					|	ТЗ.Валюта"; 
	//	Пакет =  Запрос.ВыполнитьПакет();
	//    ВыборкаИ = Пакет[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	//	Пока ВыборкаИ.Следующий() Цикл 
	//		ОбластьСтрока.Параметры.Заполнить(ВыборкаИ);  
	//		ОбластьСтрока.Параметры.ДатаОтгрузки = Шапка.ДатаПоступленияПлан;
	//		ТабДокумент.Вывести(ОбластьСтрока);
	//	КонецЦикла;
	//	
	//	Выгрузка = Пакет[2].Выгрузить();
	//	ОбластьМакета = Макет.ПолучитьОбласть("Итог"); 
	//	Если Выгрузка.Количество() > 1 Тогда
	//		Для каждого СтрокаИт Из Выгрузка Цикл
	//			ОбластьМакета.Параметры.Заполнить(СтрокаИт); 
	//			ТабДокумент.Вывести(ОбластьМакета);
	//		КонецЦикла;
	//		ОбластьМакета.Параметры.Валюта 		= НСтр("ru = 'ВСЕГО'; en = 'TOTAL'");
	//		ОбластьМакета.Параметры.Сумма 		= "";
	//		ОбластьМакета.Параметры.Символ 		= "";
	//		ОбластьМакета.Параметры.Количество 	= Выгрузка.Итог("Количество");
	//		ТабДокумент.Вывести(ОбластьМакета);
	//	Иначе
	//		ОбластьМакета.Параметры.Заполнить(Выгрузка[0]);
	//		ОбластьМакета.Параметры.Валюта 		= НСтр("ru = 'ВСЕГО'; en = 'TOTAL'");  
	//		ОбластьМакета.Параметры.Символ 		= Выгрузка[0].Валюта;
	//		ТабДокумент.Вывести(ОбластьМакета);
	//	КонецЕсли;
	//	
	//	ОбластьМакета = Макет.ПолучитьОбласть("Дно");
	//	ОбластьМакета.Параметры.Заполнить(Шапка);
	//	ТабДокумент.Вывести(ОбластьМакета);
	//
	//ИначеЕсли ВариантПечатнойФормы = "Вес" Тогда

	//	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	//	ОбластьМакета.Параметры.Заполнить(Шапка);
	//	ТабДокумент.Вывести(ОбластьМакета);

	//	Запрос.Текст = ТекстЗапросаТовары + "ВЫБРАТЬ различные
	//	                                    |	ТЗ.Номенклатура КАК Номенклатура,
	//	                                    |	ТЗ.Номенклатура.Вес КАК Вес,
	//	                                    |	СУММА(ТЗ.Количество) КАК Количество,
	//	                                    |	СУММА(ТЗ.Количество * ТЗ.Номенклатура.Вес) КАК ИтВес,
	//	                                    |	СУММА(ТЗ.Количество * ТЗ.Номенклатура.Вес/1000) КАК ИтВесКг
	//	                                    |ИЗ
	//	                                    |	ТЗ КАК ТЗ
	//	                                    |
	//	                                    |СГРУППИРОВАТЬ ПО
	//	                                    |	ТЗ.Номенклатура,
	//	                                    |	ТЗ.Номенклатура.Вес 
	//										|УПОРЯДОЧИТЬ ПО
	//										|	Номенклатура.Наименование
	//										//+
	//										|ИТОГИ 	
	//										|	СУММА(ИтВес),
	//										|	СУММА(ИтВесКг),
	//										|	СУММА(Количество)
	//										|ПО
	//										|	ОБЩИЕ, Номенклатура, Вес";
	//										//-
	//	//+
	//	ВыборкаИтог = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);  
	//	ВыборкаИтог.Следующий();
	//	ОбластьДно = Макет.ПолучитьОбласть("Дно");
	//    ОбластьДно.Параметры.Заполнить(ВыборкаИтог);
	//	//-
	//								
	//	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	//	ВыборкаВ = ВыборкаИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//	Пока ВыборкаВ.Следующий() Цикл 
	//		Выборка = ВыборкаВ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//		Пока Выборка.Следующий() Цикл
	//			ОбластьСтрока.Параметры.Заполнить(Выборка);
	//			ТабДокумент.Вывести(ОбластьСтрока);
	//		КонецЦикла; 
	//	КонецЦикла;
	//	
	//	ТабДокумент.Вывести(ОбластьДно);
	//	
	//ИначеЕсли ВариантПечатнойФормы = "ЗатратыПоГруппам" Тогда
	//	
	//	Запрос.УстановитьПараметр("Пусто", Справочники.ГруппыПодбораНоменклатуры.ПустаяСсылка());
	//	Запрос.Текст = ТекстЗапросаТовары + "ВЫБРАТЬ  
	//		|	ВЫБОР
	//		|		КОГДА ТЗ.Номенклатура.Родитель.ГруппаПодбора <> &Пусто
	//		|			ТОГДА ТЗ.Номенклатура.Родитель.ГруппаПодбора
	//		|		КОГДА ТЗ.Номенклатура.Родитель.Родитель.ГруппаПодбора <> &Пусто
	//		|			ТОГДА ТЗ.Номенклатура.Родитель.Родитель.ГруппаПодбора
	//		|		КОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.ГруппаПодбора <> &Пусто
	//		|			ТОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.ГруппаПодбора
	//		|		КОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.Родитель.ГруппаПодбора <> &Пусто
	//		|			ТОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.Родитель.ГруппаПодбора
	//		|		КОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.ГруппаПодбора <> &Пусто
	//		|			ТОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.ГруппаПодбора
	//		|		КОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ГруппаПодбора <> &Пусто
	//		|			ТОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ГруппаПодбора
	//		|	КОНЕЦ КАК ТоварнаяГруппа,
	//		|	ТЗ.Инвойс КАК Инвойс,
	//		|	ТЗ.Номенклатура КАК Номенклатура,  
	//		//+
	//		|	ТЗ.Номенклатура.Вес КАК ВесЕд, 
	//		//-
	//		|	СУММА(ТЗ.Количество) КАК Количество,
	//		|	СУММА(ТЗ.Сумма) КАК Сумма,
	//		|	СРЕДНЕЕ(ТЗ.Сумма / ТЗ.Количество) КАК Цена
	//		|ПОМЕСТИТЬ тзОтправки
	//		|ИЗ
	//		|	ТЗ КАК ТЗ
	//		|
	//		|СГРУППИРОВАТЬ ПО
	//		|	ТЗ.Инвойс,
	//		|	ВЫБОР
	//		|		КОГДА ТЗ.Номенклатура.Родитель.ГруппаПодбора <> &Пусто
	//		|			ТОГДА ТЗ.Номенклатура.Родитель.ГруппаПодбора
	//		|		КОГДА ТЗ.Номенклатура.Родитель.Родитель.ГруппаПодбора <> &Пусто
	//		|			ТОГДА ТЗ.Номенклатура.Родитель.Родитель.ГруппаПодбора
	//		|		КОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.ГруппаПодбора <> &Пусто
	//		|			ТОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.ГруппаПодбора
	//		|		КОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.Родитель.ГруппаПодбора <> &Пусто
	//		|			ТОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.Родитель.ГруппаПодбора
	//		|		КОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.ГруппаПодбора <> &Пусто
	//		|			ТОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.ГруппаПодбора
	//		|		КОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ГруппаПодбора <> &Пусто
	//		|			ТОГДА ТЗ.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ГруппаПодбора
	//		|	КОНЕЦ,
	//		|	ТЗ.Номенклатура
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|ВЫБРАТЬ
	//		|	тзОтправки.ТоварнаяГруппа КАК ТоварнаяГруппа,
	//		|	тзОтправки.Инвойс КАК Инвойс,
	//		|	тзОтправки.Номенклатура КАК Номенклатура,  
	//		//+
	//		|	тзОтправки.ВесЕд КАК ВесЕд,    
	//		//-
	//		|	тзОтправки.Количество КАК Количество,
	//		|	тзОтправки.Сумма КАК Сумма,
	//		|	тзОтправки.Цена КАК Цена,
	//		|	ОтправкаРаспределениеЗатрат.Количество КАК КоличествоЗатрат,
	//		|	ОтправкаРаспределениеЗатрат.Цена КАК ЦенаЗатрат,
	//		|	ОтправкаРаспределениеЗатрат.Вес КАК Вес,
	//		|   ОтправкаРаспределениеЗатрат.Сумма * тзОтправки.Количество/ОтправкаРаспределениеЗатрат.Количество КАК СуммаЗатрат,
	//		|   ОтправкаРаспределениеЗатрат.Сумма * тзОтправки.Количество/ОтправкаРаспределениеЗатрат.Количество КАК РасчитаннаяСуммаЗатрат
	//		|ИЗ
	//		|	тзОтправки КАК тзОтправки
	//		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//		|			ОтправкаРаспределениеЗатрат.Номенклатура КАК Номенклатура,
	//		|			ОтправкаРаспределениеЗатрат.Количество КАК Количество,
	//		|			ОтправкаРаспределениеЗатрат.Цена КАК Цена,
	//		|			ОтправкаРаспределениеЗатрат.Вес КАК Вес,
	//		|			ОтправкаРаспределениеЗатрат.Сумма КАК Сумма
	//		|		ИЗ
	//		|			Документ.Отправка.РаспределениеЗатрат КАК ОтправкаРаспределениеЗатрат
	//		|		ГДЕ
	//		|			ОтправкаРаспределениеЗатрат.Ссылка = &Ссылка) КАК ОтправкаРаспределениеЗатрат
	//		|		ПО тзотправки.Номенклатура = ОтправкаРаспределениеЗатрат.Номенклатура
	//		|ИТОГИ
	//		|	СУММА(Количество),
	//		|	СУММА(Сумма),
	//		|	СРЕДНЕЕ(Цена),
	//		|	СУММА(КоличествоЗатрат),
	//		|	СРЕДНЕЕ(ЦенаЗатрат),
	//		|	СУММА(Вес),    
	//		//+
	//		|	СРЕДНЕЕ(ВесЕд),
	//		//-
	//		|	СУММА(СуммаЗатрат),
	//		|	СУММА(РасчитаннаяСуммаЗатрат)
	//		|ПО
	//		|	ОБЩИЕ,
	//		|	Инвойс,
	//		|	ТоварнаяГруппа,
	//		|	Номенклатура"; 
	//	
	//	глВывестиСекцию(ТабДокумент, Макет, "Шапка", Шапка);
	//	
	//	//+
	//	ВыборкаИтог = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);  
	//	ВыборкаИтог.Следующий();
	//	ОбластьДно = Макет.ПолучитьОбласть("Дно");
	//    ОбластьДно.Параметры.Заполнить(ВыборкаИтог);
	//	//-
	//	
	//	ТабДокумент.НачатьАвтогруппировкуСтрок();
	//	//Инв = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Инвойс");
	//	Инв = ВыборкаИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//	
	//	Пока Инв.Следующий() Цикл
	//		ОбластьМакета = Макет.ПолучитьОбласть("Инвойс");
	//		ОбластьМакета.Параметры.Заполнить(Инв);
	//		ТабДокумент.Вывести(ОбластьМакета, 1);
	//		Грп = Инв.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//		Пока Грп.Следующий() Цикл
	//			ОбластьМакета = Макет.ПолучитьОбласть("Группа");
	//			ОбластьМакета.Параметры.Заполнить(Грп);
	//			ТабДокумент.Вывести(ОбластьМакета, 2);
	//			Ном = Грп.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//			Пока Ном.Следующий() Цикл
	//				
	//				ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	//				ОбластьМакета.Параметры.Заполнить(Ном);
	//				//ОбластьМакета.Рисунки.D1.Картинка = 
	//				ТабДокумент.Вывести(ОбластьМакета, 3);
	//				
	//			КонецЦикла;
	//		КонецЦикла;
	//	КонецЦикла;
	//	ТабДокумент.ЗакончитьАвтогруппировкуСтрок();

	//	//ОбластьДно.Параметры.Заполнить(Шапка);  
	//	//ОбластьДно.Параметры.Сумма = Итоги.Сумма;
	//	//ОбластьДно.Параметры.Количество = Итоги.Количество;
	//	ТабДокумент.Вывести(ОбластьДно);
	//	
	КонецЕсли;

КонецПроцедуры	

Процедура ВыбратьЭлементыВИерархии(ВыборкаСИерархией, Макет, ТабДокумент) 
	
	Пока ВыборкаСИерархией.Следующий() Цикл   
		
		Уровень = ВыборкаСИерархией.Номенклатура.Уровень();
		Если ВыборкаСИерархией.ТипЗаписи() = ТипЗаписиЗапроса.ИтогПоИерархии Тогда  
			
			ОбластьМакета = Макет.ПолучитьОбласть("Группа");
			ОбластьМакета.Параметры.Заполнить(ВыборкаСИерархией);
			ТабДокумент.Вывести(ОбластьМакета, Уровень);
			
			ВыбратьЭлементыВИерархии (ВыборкаСИерархией.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, "Номенклатура"), Макет, ТабДокумент);
			
		ИначеЕсли ВыборкаСИерархией.ТипЗаписи() = ТипЗаписиЗапроса. ДетальнаяЗапись Тогда

			ОбластьМакета =  Макет.ПолучитьОбласть("Строка");
			ОбластьМакета.Параметры.Заполнить(ВыборкаСИерархией); 
			ТабДокумент.Вывести(ОбластьМакета, Уровень);
			
		КонецЕсли; 
		
	КонецЦикла;    
	
КонецПроцедуры
